---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotElevTextLocation
source: html/ec92b73e-bd8c-9a71-d40d-d69aeb235310.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotElevTextLocation Property

"Text Location"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotElevTextLocation { get; }
```